---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarEmptySketch
source: html/0eaf2956-536d-27dd-0a1d-6361aed6071b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarEmptySketch Property

Rebar Sketch is empty. Can't create Rebar.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarEmptySketch { get; }
```